# YOLOv8n FullModel: GhostConv backbone + CBAM + BiFPN + DecoupledDetect.

nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, GhostConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [16, 7]] # 3
  - [-1, 1, GhostConv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [16, 7]] # 6-P3
  - [-1, 1, GhostConv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [16, 7]] # 9-P4
  - [-1, 1, GhostConv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [16, 7]] # 12
  - [-1, 1, SPPF, [1024, 5]] # 13-P5

head:
  # Lateral projections to one BiFPN channel width.
  - [6, 1, Conv, [256, 1, 1]] # 14-P3_in
  - [9, 1, Conv, [256, 1, 1]] # 15-P4_in
  - [13, 1, Conv, [256, 1, 1]] # 16-P5_in

  # Top-down BiFPN path.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17-P5_up
  - [[15, 17], 1, BiFPNFusion, [256]] # 18-P4_td
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19-P4_up
  - [[14, 19], 1, BiFPNFusion, [256]] # 20-P3_out

  # Bottom-up BiFPN path.
  - [20, 1, Conv, [256, 3, 2]] # 21-P3_down
  - [[15, 18, 21], 1, BiFPNFusion, [256]] # 22-P4_out
  - [22, 1, Conv, [256, 3, 2]] # 23-P4_down
  - [[16, 23], 1, BiFPNFusion, [256]] # 24-P5_out

  - [[20, 22, 24], 1, DecoupledDetect, [nc, 192]] # DecoupledDetect(P3, P4, P5)
