# YOLOv8n with the PAN-FPN head replaced by a BiFPN neck.

nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9-P5

head:
  # Lateral projections to one BiFPN channel width.
  - [4, 1, Conv, [256, 1, 1]] # 10-P3_in
  - [6, 1, Conv, [256, 1, 1]] # 11-P4_in
  - [9, 1, Conv, [256, 1, 1]] # 12-P5_in

  # Top-down BiFPN path.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13-P5_up
  - [[11, 13], 1, BiFPNFusion, [256]] # 14-P4_td
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-P4_up
  - [[10, 15], 1, BiFPNFusion, [256]] # 16-P3_out

  # Bottom-up BiFPN path.
  - [16, 1, Conv, [256, 3, 2]] # 17-P3_down
  - [[11, 14, 17], 1, BiFPNFusion, [256]] # 18-P4_out
  - [18, 1, Conv, [256, 3, 2]] # 19-P4_down
  - [[12, 19], 1, BiFPNFusion, [256]] # 20-P5_out

  - [[16, 18, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
